---
kind: method
id: M:Autodesk.Revit.UI.Selection.Selection.Dispose
source: html/4c6eef15-6691-4675-600c-7a12a09738f9.htm
---
# Autodesk.Revit.UI.Selection.Selection.Dispose Method

Releases all resources used by the Selection

## Syntax (C#)
```csharp
public void Dispose()
```